import { Movie } from '../types/Movie';

export const movies: Movie[] = [
  {
    id: 1,
    title: 'Побег из Шоушенка',
    description: 'Два заключённых находят дружбу и искупление в тюремных стенах.',
    year: 1994,
  },
  {
    id: 2,
    title: 'Крёстный отец',
    description: 'Глава мафиозной семьи передаёт власть своему младшему сыну.',
    year: 1972,
  },
  {
    id: 3,
    title: 'Тёмный рыцарь',
    description: 'Бэтмен противостоит безумному преступнику Джокеру.',
    year: 2008,
  },
  {
    id: 4,
    title: 'Криминальное чтиво',
    description: 'Переплетающиеся истории о наёмных убийцах, боксёре и гангстерах.',
    year: 1994,
  },
  {
    id: 5,
    title: 'Список Шиндлера',
    description: 'Немецкий бизнесмен спасает более тысячи евреев во время Холокоста.',
    year: 1993,
  },
  {
    id: 6,
    title: 'Интерстеллар',
    description: 'Группа исследователей использует червоточину для поиска новой планеты для человечества.',
    year: 2014,
  },
];
